---
kind: property
id: P:Autodesk.Revit.DB.ElementArray.Size
source: html/9df2d645-7689-5bb8-587f-1ec6d2a28cfa.htm
---
# Autodesk.Revit.DB.ElementArray.Size Property

Returns the number of elements that are in the array.

## Syntax (C#)
```csharp
public virtual int Size { get; }
```